---
kind: enumMember
id: F:Autodesk.Revit.DB.ImportPlacement.Shared
enum: Autodesk.Revit.DB.ImportPlacement
source: html/3c54b2eb-2378-c692-4c00-46088b684604.htm
---
# Autodesk.Revit.DB.ImportPlacement.Shared

Placement with respect to the shared coordinates.
 Revit Building places the imported geometry according to its location
 with respect to the shared coordinates between the two files.
 There must be shared coordinates in a Revit document in order for this option to be valid.